# Predicting how Microsoft can launch into the movie business 
## a. Business understanding
Microsoft is a company that is well known for making great software prducts which are wired towards the windows operating systems and most of the software that is in line with that. Microsoft is a company that was formed in 1975. Its main objective is to ensure that its customers are comfortable when working, playing or communicate while interacting with the product. Microsoft has offices in more than 100 countries.

Microsoft mainly gains its profits from developing, licensing many products and services in conjuction with selling hardware and software which is one of their major strongholds. Microsoft also has products such as personal computers, servers, mobile phones. They also deal with hardware such as Xbox gaming and entertainment console, Xbox 360 accessories and other hardware products. They also provide consultation, product and support services and all kind of cloud based solutions. 

Movie making is a craft which most companies are leveraging based on the fact that most companies are gaining through it. This is whereby most companies take their time to come up with, create files and videos which are are attached together to come up with excellent movies altogether. 

Microsoft having witnessed how this has helped other companies, its therefore looking for ways in which they can also leverage on that to ensure that they also achieve from that.Microsoft wants to venture into the movie making business. Microsoft being a technological company, this has proved to be  a weighty matter since thy have not handled such kind of a business before. 

The project involves use of data to help Microsoft have the knowhow of making a movie, what is involved in the process  and know which movies are doing best right know so that they will most likely invest in that to capitalize in making much profits. 

## b. Problem Statement
Movie making is an interesting art which most companies enjoy to do. The art has caused some companies to make way much profits than other in the previous years. Microsoft therefore is looking at ways in which they can do this and be better at it.
In that spirit, I have decided to use a few instuments in my learning curve to ensure that Microsoft can make better decisions in this journey.

## c. Main Objective
To develop a model that Microsoft can use as they begin their videos company and achieve consistent growth as they do so.

## d. Specific Objectives
. Develop and test machine learning models that showcases what criteria will be used to achieve good profits in this venture
. Evaluate the previous companies and how they have made profits in order to check if the same or an altered strategy can work for us
 
 ## e. Experimental Design
 1. Data collection
 2. Read and check data
 3. Cleaning the data
 4. Exploratory Data Analysis
 5. Data modelling and model performance evaluation
 6. Use the model to make predictions
 7. Conclusions
 8. Deploy the model


## f. Data Understanding
The data used in this project was given by our technical mentor

# Importing Libraries

In [20]:
# Initializing all the imports
import pandas as pd
import numpy as np
import csv
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')
import sqlite3
import subprocess

# Reading the data

In [21]:
# We read data from the csv file to know what is inside in the first five rows
df = pd.read_csv('bom.movie_gross.csv')
df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [22]:
# Opening the review document
movie_reviews = pd.read_csv('rt.reviews.tsv', encoding='latin-1', delimiter = '\t')
movie_reviews.head(15)

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
5,3,... Cronenberg's Cosmopolis expresses somethin...,NaN,fresh,Michelle Orange,0,Capital New York,"September 11, 2017"
6,3,"Quickly grows repetitive and tiresome, meander...",C,rotten,Eric D. Snider,0,EricDSnider.com,"July 17, 2013"
7,3,Cronenberg is not a director to be daunted by ...,2/5,rotten,Matt Kelemen,0,Las Vegas CityLife,"April 21, 2013"
8,3,"Cronenberg's cold, exacting precision and emot...",NaN,fresh,Sean Axmaker,0,Parallax View,"March 24, 2013"
9,3,Over and above its topical urgency or the bit ...,NaN,fresh,Kong Rithdee,0,Bangkok Post,"March 4, 2013"
10,3,"Cosmopolis"" is a hypnotic examination of our m...",NaN,fresh,Tim Grierson,0,Deadspin,"February 12, 2013"
11,3,"While not one of Cronenberg's stronger films, ...",B-,fresh,Emanuel Levy,0,EmanuelLevy.Com,"February 3, 2013"
12,3,Robert Pattinson works mighty hard to make Cos...,2/4,rotten,Christian Toto,0,Big Hollywood,"January 15, 2013"
13,3,The anger over the injustice of the financial ...,B,fresh,Robert Roten,0,Laramie Movie Scope,"January 7, 2013"
14,3,For those who like their Cronenberg thick and ...,3/4,fresh,Marty Mapes,0,Movie Habit,"October 20, 2012"

In [23]:
# Opening the ratings document
movie_ratings = pd.read_csv('imdb.title.ratings.csv.gz')
movie_ratings.head(15)

        tconst  averagerating  numvotes
0   tt10356526            8.3        31
1   tt10384606            8.9       559
2    tt1042974            6.4        20
3    tt1043726            4.2     50352
4    tt1060240            6.5        21
5    tt1069246            6.2       326
6    tt1094666            7.0      1613
7    tt1130982            6.4       571
8    tt1156528            7.2       265
9    tt1161457            4.2       148
10   tt1171222            5.1      8296
11   tt1174693            5.8      2381
12   tt1181840            7.0      5494
13   tt1193623            8.0         5
14   tt1199588            5.5        74

In [24]:
# Opening the movies budget document
movie_budget = pd.read_csv('tn.movie_budgets.csv')
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [25]:
# Opening the akas document
Professionals_names = pd.read_csv('name.basics.csv')
Professionals_names

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [ ]:
# Opening the movies budget document
movie_budget = pd.read_csv('tn.movie_budgets.csv')
movie_budget.head()

## Data Wrangling
### Dropping columns and rows

The column year here isn't essential because we are looking to find the profits from the table below

In [27]:
#Dropping the year column in the movies 
df.drop(['year'], axis = 1, inplace = True)
df

,title,studio,domestic_gross,foreign_gross
0,Toy Story 3,BV,415000000.0,652000000
1,Alice in Wonderland (2010),BV,334200000.0,691300000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000
3,Inception,WB,292600000.0,535700000
4,Shrek Forever After,P/DW,238700000.0,513900000
...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN
3383,Edward II (2018 re-release),FM,4800.0,NaN
3384,El Pacto,Sony,2500.0,NaN
3385,The Swan,Synergetic,2400.0,NaN
3386,An Actor Prepares,Grav.,1700.0,NaN

Here we drop the missing values to ensure we don't work ith data that is empty because it will give outliers which will be disastrous to our data analysis

In [28]:
# Dropping the foreign gross for missing values
df.dropna(subset= ['foreign_gross'], inplace = True)
df.tail()

,title,studio,domestic_gross,foreign_gross
3275,I Still See You,LGF,1400.0,1500000
3286,The Catcher Was a Spy,IFC,725000.0,229000
3309,Time Freak,Grindstone,10000.0,256000
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000

In [29]:
# Dropping the domestic gross for missing values
df.dropna(subset= ['domestic_gross'], inplace = True)
df.head()

,title,studio,domestic_gross,foreign_gross
0,Toy Story 3,BV,415000000.0,652000000
1,Alice in Wonderland (2010),BV,334200000.0,691300000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000
3,Inception,WB,292600000.0,535700000
4,Shrek Forever After,P/DW,238700000.0,513900000

In [39]:
#converting the foreign_gross column into a float datatype  by removing ',' characters and converting it to float
df.foreign_gross = df.foreign_gross.map( lambda x: float(x.replace(',','')))

<class 'pandas.core.frame.DataFrame'>
Index: 2009 entries, 0 to 3353
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2009 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2009 non-null   float64
 3   foreign_gross   2009 non-null   float64
dtypes: float64(2), object(2)
memory usage: 78.5+ KB

Check for the data of this table to check of its available values and what is missing

In [41]:
#Create a new column sum_of_gross by adding domestic_gross and foreign_gross 

df['sum_of_gross']= df.domestic_gross + df.foreign_gross

# dropping the domestic_gross and foreign_gross columns
df.drop(['domestic_gross','foreign_gross'], axis=1, inplace= True)

In [43]:
# Checking the details of the df
df.columns
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2009 entries, 0 to 3353
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         2009 non-null   object
 1   studio        2007 non-null   object
 2   sum_of_gross  2009 non-null   float64
dtypes: float64(1), object(2)
memory usage: 62.8+ KB

In [44]:
#Check whether there is missing data in the sum_of_gross other than the title for now

for col in df.columns[1:]:
    print(col, '\n', df[col].value_counts(normalize=True).head(), '\n\n')

studio
 studio
Uni.    0.071749
Fox     0.066766
WB      0.064773
Sony    0.052317
BV      0.051819
Name: proportion, dtype: float64


sum_of_gross
 sum_of_gross
7900000.0     0.002489
27400000.0    0.002489
15400000.0    0.002489
16900000.0    0.002489
43000000.0    0.001991
Name: proportion, dtype: float64

In [45]:
# Since our data is clean know, we can check how the data looks like by using .describe
df.describe()

       sum_of_gross
count  2.009000e+03
mean   1.226913e+08
std    2.074870e+08
min    4.900000e+03
25%    8.141000e+06
50%    4.230000e+07
75%    1.337000e+08
max    1.518900e+09

The sum_of_gross column has a mean of 122,810,200 ,a Standard deviation of 207,556,200 and a median of 42,400,000, which is a clear picture that our plot could skew to the positive side

In [31]:
Professionals_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [32]:
#Dropping the birth and death year column in the movies 
Professionals_names.drop(['birth_year', 'death_year'], axis = 1, inplace = True)
Professionals_names

,nconst,primary_name,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...
606643,nm9990381,Susan Grobes,actress,NaN
606644,nm9990690,Joo Yeon So,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,producer,NaN
606647,nm9993380,Pegasus Envoyé,"director,actor,writer",tt8743182

In [33]:
# Dropping the missing values in known for titles column
Professionals_names.dropna(subset= ['known_for_titles'], inplace = True)
Professionals_names.head()

,nconst,primary_name,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [38]:


# Merge df with movie_budget based on a common key (e.g., movie title or ID)
df_merged = df.merge(movie_budget, on='title')

KeyError: 'title'

In [35]:
# # Descriptive statistics for numeric variables
# numeric_columns = ['domestic_gross', 'foreign_gross', 'production_budget']
# numeric_data = df[numeric_columns]

# # Compute summary statistics
# summary_stats = numeric_data.describe()
# print(summary_stats)

In [36]:
# # Histogram of domestic gross
# plt.hist(df['domestic_gross'], bins=20)
# plt.xlabel('Domestic Gross')
# plt.ylabel('Frequency')
# plt.title('Distribution of Domestic Gross')
# plt.show()

# # Bar chart of movie genres
# genre_counts = df['genre'].value_counts()
# plt.bar(genre_counts.index, genre_counts.values)
# plt.xlabel('Genre')
# plt.ylabel('Count')
# plt.title('Number of Movies by Genre')
# plt.xticks(rotation=90)
# plt.show()

# # Scatter plot of budget vs. domestic gross
# plt.scatter(df['production_budget'], df['domestic_gross'])
# plt.xlabel('Production Budget')
# plt.ylabel('Domestic Gross')
# plt.title('Budget vs. Domestic Gross')
# plt.show()